package prof.homeworks._06_19_Lesson2.task3;

/*
Задача 3. Обработка команд от пользователя
Описание:
Создайте интерфейс Command с методом void execute().
Реализуйте несколько классов-команд:
PrintHello — выводит "Hello!"
PrintDate — выводит текущую дату (можно просто System.out.println("Today is June 19") для простоты)
PrintBye — выводит "Bye!"
Требуется:
Поместите команды в массив Command[].
Создайте метод runAll(Command[] commands), который вызывает метод execute() у каждой команды.
 */
public class Main {
    public static void main(String[] args) {

    }
}
